RT-Thread/rt-thread/bsp/nxp/imx/imxrt/imxrt1180-nxp-evk/cm33/board/pin_mux.h
/*
 * Copyright 2026 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AON_08 (coord B1), LPUART1_TXD/U61[4]/J39[4]/J70[4] */
/* Routed pin properties */
#define BOARD_INITPINS_LPUART1_TXD_PERIPHERAL                            LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_LPUART1_TXD_SIGNAL                                    TXD   /*!< Signal name */

/* GPIO_AON_09 (coord A5), LPUART1_RXD/U61[3]/J39[2]/J70[3] */
/* Routed pin properties */
#define BOARD_INITPINS_LPUART1_RXD_PERIPHERAL                            LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_LPUART1_RXD_SIGNAL                                    RXD   /*!< Signal name */

/* GPIO_AD_27 (coord M16), USER_LED_CTL1/Q7[1] */
/* Routed pin properties */
#define BOARD_INITPINS_USER_LED_CTL1_PERIPHERAL                           RGPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_USER_LED_CTL1_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITPINS_USER_LED_CTL1_CHANNEL                                 27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_USER_LED_CTL1_GPIO                                 RGPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_USER_LED_CTL1_INIT_GPIO_VALUE                          0U   /*!< GPIO output initial state */
#define BOARD_INITPINS_USER_LED_CTL1_GPIO_PIN                                27U   /*!< GPIO pin number */
#define BOARD_INITPINS_USER_LED_CTL1_GPIO_PIN_MASK                   (1U << 27U)   /*!< GPIO pin mask */

/* GPIO_AD_02 (coord R13), DMIC_DATA1/U118[1]/J45[11]/J69[5]/J41[2]/J67[6] */
/* Routed pin properties */
#define BOARD_INITPINS_DMIC_DATA1_PERIPHERAL                                ADC1   /*!< Peripheral name */
#define BOARD_INITPINS_DMIC_DATA1_SIGNAL                                       A   /*!< Signal name */
#define BOARD_INITPINS_DMIC_DATA1_CHANNEL                                     1U   /*!< Signal channel */

/* GPIO_AD_07 (coord T17), USB_OTG2_PWR/WIFI_RST_B/J39[14]/J44[3]/J69[10]/U43[3] */
/* Routed pin properties */
#define BOARD_INITPINS_USB_OTG2_PWR_PERIPHERAL                              ADC1   /*!< Peripheral name */
#define BOARD_INITPINS_USB_OTG2_PWR_SIGNAL                                     B   /*!< Signal name */
#define BOARD_INITPINS_USB_OTG2_PWR_CHANNEL                                   1U   /*!< Signal channel */

/* GPIO_AD_08 (coord T14), USB_OTG2_ID/J39[16]/J69[11]/J62[1]/J68[4]/U40[3]/U39[A1] */
/* Routed pin properties */
#define BOARD_INITPINS_USB_OTG2_ID_PERIPHERAL                               ADC1   /*!< Peripheral name */
#define BOARD_INITPINS_USB_OTG2_ID_SIGNAL                                      A   /*!< Signal name */
#define BOARD_INITPINS_USB_OTG2_ID_CHANNEL                                    1U   /*!< Signal channel */

/* GPIO_AD_03 (coord R15), DMIC_DATA2/U117[1]/J45[9]/J69[6]/J41[4]/J67[8] */
/* Routed pin properties */
#define BOARD_INITPINS_DMIC_DATA2_PERIPHERAL                                ADC1   /*!< Peripheral name */
#define BOARD_INITPINS_DMIC_DATA2_SIGNAL                                       B   /*!< Signal name */
#define BOARD_INITPINS_DMIC_DATA2_CHANNEL                                     1U   /*!< Signal channel */

/* GPIO_AD_04 (coord P15), DMIC_DATA3/U119[1]/J45[5]/J69[7]/J41[6]/J67[10] */
/* Routed pin properties */
#define BOARD_INITPINS_DMIC_DATA3_PERIPHERAL                                ADC1   /*!< Peripheral name */
#define BOARD_INITPINS_DMIC_DATA3_SIGNAL                                       A   /*!< Signal name */
#define BOARD_INITPINS_DMIC_DATA3_CHANNEL                                     1U   /*!< Signal channel */

/* GPIO_AD_05 (coord P13), WL_DEV_WAKE/J45[7]/J69[8]/J41[8]/U43[10] */
/* Routed pin properties */
#define BOARD_INITPINS_WL_DEV_WAKE_PERIPHERAL                               ADC1   /*!< Peripheral name */
#define BOARD_INITPINS_WL_DEV_WAKE_SIGNAL                                      B   /*!< Signal name */
#define BOARD_INITPINS_WL_DEV_WAKE_CHANNEL                                    1U   /*!< Signal channel */

/* GPIO_AD_18 (coord K16), I3C2_SCL/LPI2C3_eCAT_SCL/BT_WAKE_B_3V3/J41[12]/J70[5]/J50[1]/U46[13]/J51[3]/J36[20]/U48[6]/J47[13] */
/* Routed pin properties */
#define BOARD_INITPINS_I3C2_SCL_PERIPHERAL                                  ADC2   /*!< Peripheral name */
#define BOARD_INITPINS_I3C2_SCL_SIGNAL                                         A   /*!< Signal name */
#define BOARD_INITPINS_I3C2_SCL_CHANNEL                                       2U   /*!< Signal channel */

/* GPIO_AD_19 (coord L13), I3C2_SDA/LPI2C3_eCAT_SDA/J41[10]/J70[6]/J50[2]/U46[14]/J51[5]/U48[5]/J47[15] */
/* Routed pin properties */
#define BOARD_INITPINS_I3C2_SDA_PERIPHERAL                                  ADC2   /*!< Peripheral name */
#define BOARD_INITPINS_I3C2_SDA_SIGNAL                                         B   /*!< Signal name */
#define BOARD_INITPINS_I3C2_SDA_CHANNEL                                       2U   /*!< Signal channel */

/*!
 * @brief 
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
